In [1]:
import pandas as pd
import numpy as np

In [8]:
cluster_data=pd.read_csv('clustering_1.txt',sep=" ", header=None, names=['index','cluster'])

In [9]:
cluster_data.head()

   index  cluster
0      1        2
1      2        0
2      3        2
3      4        1
4      5        2

In [14]:
truth_data=pd.read_csv('partitions.txt',sep=" ", header=None, names=['index','truth'])

In [15]:
truth_data.tail()

     index  truth
295    296      0
296    297      0
297    298      2
298    299      2
299    300      2

In [16]:
df=cluster_data.set_index('index').join(truth_data.set_index('index'))

In [17]:
df.head()

       cluster  truth
index
1            2      2
2            0      0
3            2      2
4            1      1
5            2      2

In [19]:
df['cluster'].value_counts()

2    100
1    100
0    100
Name: cluster, dtype: int64

In [20]:
df.groupby('cluster').size()

cluster
0    100
1    100
2    100
dtype: int64

In [24]:
N_ct = df.groupby(['cluster','truth']).size().to_frame()

In [28]:
N_ct

                0
cluster truth
0       0      98
        1       2
1       0       1
        1      97
        2       2
2       0       1
        1       1
        2      98

In [32]:
N_ct.loc[(0,1),0]

2

In [33]:
df.groupby(['cluster','truth']).size().to_dict()

{(0, 0): 98,
 (0, 1): 2,
 (1, 0): 1,
 (1, 1): 97,
 (1, 2): 2,
 (2, 0): 1,
 (2, 1): 1,
 (2, 2): 98}

In [35]:
df.pivot_table(index='cluster',columns='truth',aggfunc=len).fillna(0)

truth       0     1     2
cluster
0        98.0   2.0   0.0
1         1.0  97.0   2.0
2         1.0   1.0  98.0

In [36]:
def combination(n, k):
    """ Code for combination formula i.e. "n choose k" """
    from math import factorial
    return factorial(n) / (factorial(n - k) * factorial(k))

In [37]:
combination(3,2)

3.0